package study0123;

public class study0123_1 {

	public static void main(String[] args) {
		// 비트 논리 연산자
		System.out.println(27&13);			// &연산, 두 가지 다 참이어야 참
		// 1 1 0 1 1  > 27
		// 0 1 1 0 1  > 13
		// ----------
		// 0 1 0 0 1  >  9
		System.out.println(27 | 13);			// |연산, 하나라도 참이라면 참
		// 1 1 0 1 1  > 27
		// 0 1 1 0 1  > 13
		// ----------
		// 1 1 1 1 1  >  31
		System.out.println(27 ^ 13);			// ^(xor)연산, 두 가지가 참이라면 거짓, 하나라도 참이라면 참
		// 1 1 0 1 1  > 27							// 다름을 표현하기 위해 자주 쓰임
		// 0 1 1 0 1  > 13
		// ----------
		// 1 0 1 1 0  > 22 
	
	}

}
