package study0131;

import java.util.Scanner;

public class homework0131 {

	public static void main(String[] args) {
		// 싸다구 주차장 주차비 결제
		// 주차장의 기본 요금은 1000원이고 기본 시간은 30분이다.
		// 10분당 100원씩 추가요금
		// 34분 주차시 1000원, 40분 주차시 1100원, 51분 주차시 1200원
		// 2시간 주차시 기본요금은 1700원이다.
		// 10분당 100원씩 추가 요금
		// 2시간 10분 주차하면 1800원, 3시간 21분 주차하면 2500원
		// 4시간 이상 주차시 기본요금은 2500원이다.
		// 4시간 15분 주차시 2600원이다.
		// 8시간 이상 주차시 무조건 10000원이다.
		// 주차시간(몇시간 몇분) 입력하여 주차요금이 얼마인지 출력하세요.
		
		
		
		
		
		
		
		
		
		
	}

}
